In [1]:
import pandas as pd
import numpy as np

In [2]:
confirm = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')
# recover = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_recovered_global.csv')
death = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_deaths_global.csv')

In [3]:
confirm.to_csv('confirm.csv', index=False)
# recover.to_csv('recover.csv', index=False)
death.to_csv('death.csv', index=False)

In [4]:
confirm.shape

(284, 796)

In [5]:
# recover.shape

(269, 796)

In [6]:
death.shape

(284, 796)

In [7]:
confirm.head()

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/14/22,3/15/22,3/16/22,3/17/22,3/18/22,3/19/22,3/20/22,3/21/22,3/22/22,3/23/22
0,NaN,Afghanistan,33.93911,67.709953,0,0,0,0,0,0,...,176409,176571,176743,176918,176983,177039,177093,177191,177255,177321
1,NaN,Albania,41.15330,20.168300,0,0,0,0,0,0,...,272689,272711,272804,272885,272961,273040,273088,273088,273146,273164
2,NaN,Algeria,28.03390,1.659600,0,0,0,0,0,0,...,265457,265478,265496,265511,265524,265539,265550,265562,265573,265585
3,NaN,Andorra,42.50630,1.521800,0,0,0,0,0,0,...,38794,38794,38794,39234,39234,39234,39234,39234,39234,39713
4,NaN,Angola,-11.20270,17.873900,0,0,0,0,0,0,...,98931,98956,98985,99003,99003,99003,99003,99010,99058,99058

In [29]:
# recover.head()

  Province/State Country/Region       Lat       Long  recover
0            NaN    Afghanistan  33.93911  67.709953        0
1            NaN        Albania  41.15330  20.168300        0
2            NaN        Algeria  28.03390   1.659600        0
3            NaN        Andorra  42.50630   1.521800        0
4            NaN         Angola -11.20270  17.873900        0

In [8]:
# confirm.fillna("", inplace=True)
# recover.fillna("", inplace=True)
# death.fillna("", inplace=True)

In [9]:
temp = confirm.iloc[:,:4]
temp['confirm'] = confirm.iloc[:,-1]
confirm = temp

In [10]:
confirm.head()

  Province/State Country/Region       Lat       Long  confirm
0            NaN    Afghanistan  33.93911  67.709953   177321
1            NaN        Albania  41.15330  20.168300   273164
2            NaN        Algeria  28.03390   1.659600   265585
3            NaN        Andorra  42.50630   1.521800    39713
4            NaN         Angola -11.20270  17.873900    99058

In [11]:
# temp = recover.iloc[:,:4]
# temp['recover'] = recover.iloc[:,-1]
# recover = temp

In [12]:
# recover.head()

  Province/State Country/Region       Lat       Long  recover
0            NaN    Afghanistan  33.93911  67.709953        0
1            NaN        Albania  41.15330  20.168300        0
2            NaN        Algeria  28.03390   1.659600        0
3            NaN        Andorra  42.50630   1.521800        0
4            NaN         Angola -11.20270  17.873900        0

In [13]:
temp = death.iloc[:,:4]
temp['death'] = death.iloc[:,-1]
death = temp

In [14]:
death.head()

  Province/State Country/Region       Lat       Long  death
0            NaN    Afghanistan  33.93911  67.709953   7657
1            NaN        Albania  41.15330  20.168300   3489
2            NaN        Algeria  28.03390   1.659600   6873
3            NaN        Andorra  42.50630   1.521800    153
4            NaN         Angola -11.20270  17.873900   1900

In [15]:
# data = confirm.merge(recover, sort=False, on=['Province/State','Country/Region','Lat','Long'], how='left')

In [16]:
# data.shape

(284, 6)

In [17]:
# data.head()

  Province/State Country/Region       Lat       Long  confirm  recover
0            NaN    Afghanistan  33.93911  67.709953   177321      0.0
1            NaN        Albania  41.15330  20.168300   273164      0.0
2            NaN        Algeria  28.03390   1.659600   265585      0.0
3            NaN        Andorra  42.50630   1.521800    39713      0.0
4            NaN         Angola -11.20270  17.873900    99058      0.0

In [30]:
# data = data.merge(death, sort=False, on=['Province/State','Country/Region','Lat','Long'], how='left')
data = confirm.merge(death, sort=False, on=['Province/State','Country/Region','Lat','Long'], how='left')

In [31]:
data.shape

(284, 6)

In [32]:
data.head()

  Province/State Country/Region       Lat       Long  confirm  death
0            NaN    Afghanistan  33.93911  67.709953   177321   7657
1            NaN        Albania  41.15330  20.168300   273164   3489
2            NaN        Algeria  28.03390   1.659600   265585   6873
3            NaN        Andorra  42.50630   1.521800    39713    153
4            NaN         Angola -11.20270  17.873900    99058   1900

In [33]:
data.isna().sum()

Province/State    195
Country/Region      0
Lat                 2
Long                2
confirm             0
death               0
dtype: int64

In [36]:
# data['recover'].fillna(0, inplace=True)

In [37]:
data['Province/State'].fillna('', inplace=True)

In [38]:
# data['recover']=data['recover'].astype('int')

In [39]:
data.isna().sum()

Province/State    0
Country/Region    0
Lat               2
Long              2
confirm           0
death             0
dtype: int64

In [40]:
# data.columns = ['state','country','lat','long','confirm','recover','death']
data.columns = ['state','country','lat','long','confirm','death']

In [41]:
data.head()

  state      country       lat       long  confirm  death
0        Afghanistan  33.93911  67.709953   177321   7657
1            Albania  41.15330  20.168300   273164   3489
2            Algeria  28.03390   1.659600   265585   6873
3            Andorra  42.50630   1.521800    39713    153
4             Angola -11.20270  17.873900    99058   1900

In [28]:
data.to_json('../frontend/src/assets/data/data.json', orient='records' )